In [3]:
# IMPORTING LIBRARIES
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import GridSearchCV
from sklearn.metrics import accuracy_score
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score
import warnings
warnings.filterwarnings('ignore')

In [2]:
# IMPORTING THE DATASET
data= pd.read_csv('Fraud_Check.csv')
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [4]:
# DATA PREPROCESSING
# ALGORITHM TO CLASSIFY GOOD AND RISKY COSTUMERS
def risky(x):
    status=[]
    for i in x:
        if i<=30000:
            status.append('risky')
        elif i >30000:
            status.append('Good') 
    return status

In [5]:
status=pd.DataFrame(risky(data['Taxable.Income']),columns=['status'])

In [6]:
data['status']=status

In [7]:
data

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,status
0,NO,Single,68833,50047,10,YES,Good
1,YES,Divorced,33700,134075,18,YES,Good
2,NO,Married,36925,160205,30,YES,Good
3,YES,Single,50190,193264,15,YES,Good
4,NO,Married,81002,27533,28,NO,Good
...,...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES,Good
596,YES,Divorced,69967,55369,2,YES,Good
597,NO,Divorced,47334,154058,0,YES,Good
598,YES,Married,98592,180083,17,NO,Good
599,NO,Divorced,96519,158137,16,NO,Good

In [8]:
data.rename(columns={'Marital.Status':'Marital_Status','Taxable.Income':'Taxable_Income','City.Population':'City_Population','Work.Experience':'Work_Experience'},inplace=True)

In [9]:
data

,Undergrad,Marital_Status,Taxable_Income,City_Population,Work_Experience,Urban,status
0,NO,Single,68833,50047,10,YES,Good
1,YES,Divorced,33700,134075,18,YES,Good
2,NO,Married,36925,160205,30,YES,Good
3,YES,Single,50190,193264,15,YES,Good
4,NO,Married,81002,27533,28,NO,Good
...,...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES,Good
596,YES,Divorced,69967,55369,2,YES,Good
597,NO,Divorced,47334,154058,0,YES,Good
598,YES,Married,98592,180083,17,NO,Good
599,NO,Divorced,96519,158137,16,NO,Good

In [10]:
# LABEL ENCODING
le = LabelEncoder()
data['Undergrad']= le.fit_transform(data['Undergrad'])
data['Marital_Status']= le.fit_transform(data['Marital_Status'])
data['Urban']= le.fit_transform(data['Urban'])
data['status']= le.fit_transform(data['status'])
data

,Undergrad,Marital_Status,Taxable_Income,City_Population,Work_Experience,Urban,status
0,0,2,68833,50047,10,1,0
1,1,0,33700,134075,18,1,0
2,0,1,36925,160205,30,1,0
3,1,2,50190,193264,15,1,0
4,0,1,81002,27533,28,0,0
...,...,...,...,...,...,...,...
595,1,0,76340,39492,7,1,0
596,1,0,69967,55369,2,1,0
597,0,0,47334,154058,0,1,0
598,1,1,98592,180083,17,0,0
599,0,0,96519,158137,16,0,0

In [12]:
X=data.iloc[:,0:6]
Y=data['status']

In [13]:
X.drop('Marital_Status',axis=1,inplace=True)

In [15]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.20)

In [16]:
# MODEL BUILDING
num_trees = 100
max_features = 3
classifier = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)
classifier.fit(X_train,Y_train)

RandomForestClassifier(max_features=3)

In [18]:
pred=classifier.predict(X_test)

In [19]:
pd.crosstab(Y_test,pred)

col_0    0   1
status
0       99   1
1        0  20

In [20]:
np.mean(pred==Y_test)

0.9916666666666667

 - Model  has Accuracy of 99.1%

In [22]:
# MODEL VALIDATION (CROSS VALIDATION SCORE)
kfold= KFold(n_splits=10, random_state=7, shuffle=True)
cross_val_score(classifier,X,Y,cv=kfold).mean()*100

99.83333333333334